chore: move firmware to Arduino-compliant folder structure
